src/cf/InformationRegisters/ФиксированныеВзносыИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФиксированныеВзносыИП</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РазмерПФР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФОМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерЕдиныйТариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ФиксированныеВзносыИП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда



#Область ПрограммныйИнтерфейс

Процедура УстановитьФиксированныеВзносыИП() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ФиксированныеВзносыИП.СоздатьНаборЗаписей();
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20180101';
	НоваяСтрока.РазмерПФР = 26545;
	НоваяСтрока.РазмерФОМС = 5840;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20190101';
	НоваяСтрока.РазмерПФР = 29354;
	НоваяСтрока.РазмерФОМС = 6884;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20200101';
	НоваяСтрока.РазмерПФР = 32448;
	НоваяСтрока.РазмерФОМС = 8426;     
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20210101';
	НоваяСтрока.РазмерПФР = 32448;
	НоваяСтрока.РазмерФОМС = 8426;

	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20220101';
	НоваяСтрока.РазмерПФР = 34445;
	НоваяСтрока.РазмерФОМС = 8766;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20230101';
	НоваяСтрока.РазмерПФР = 0;
	НоваяСтрока.РазмерФОМС = 0;
	НоваяСтрока.РазмерЕдиныйТариф = 45842;	

	НаборЗаписей.Записать();
	
КонецПроцедуры

// Возвращает структуру, содержащую размер фиксированных взносов в ПФР и ФОМС на переданную дату
//
Функция ФиксированныеВзносыИПНаДату(Дата = Неопределено) Экспорт
	
	ТекущиеВзносы = Новый Структура("РазмерПФР,РазмерФОМС,РазмерЕдиныйТариф", 0, 0, 0);
	
	// МРОТ
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ФиксированныеВзносыИП.РазмерПФР КАК РазмерПФР,
	|	ФиксированныеВзносыИП.РазмерФОМС КАК РазмерФОМС,
	|	ФиксированныеВзносыИП.РазмерЕдиныйТариф КАК РазмерЕдиныйТариф
	|ИЗ
	|	РегистрСведений.ФиксированныеВзносыИП.СрезПоследних(&ДатаСреза, ) КАК ФиксированныеВзносыИП");
	Запрос.УстановитьПараметр("ДатаСреза", НачалоГода(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеВзносы, Выборка);
	КонецЕсли;
	
	Возврат ТекущиеВзносы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
